In [6]:
import pandas as pd

#1.	Write a Pandas program to split the following dataframe into groups based on school code. Also check the type of GroupBy object.
read=pd.read_excel('E:/Aroha Tech/Pandas Session/10th Aug/School Data.xlsx')
#df=pd.DataFrame(read)
read

  School Class            Name        DOB  Age  Height  Weight  Address
0   s001     V  Alberto Franco 2002-05-15   12     173      35  street1
1   s002     V    Gino Mcneill 2002-05-17   12     192      32  street2
2   s003    VI     Ryan Parkes 1999-02-16   13     186      33  street3
3   s001    VI    Eesha Hinton 1998-09-25   13     167      30  street1
4   s002     V    Gino Mcneill 2002-05-11   14     151      31  street2
5  s004     VI    David Parkes 1997-09-15   12     159      32  street4

In [7]:
type(read)

pandas.core.frame.DataFrame

In [16]:
#2.	Write a Pandas program to split the following dataframe by school code and get mean, min, and max value of age for each school.
grouped_School_code = read.groupby('School')
grouped_School_code.first()

       Class            Name        DOB  Age  Height  Weight  Address
School
s001       V  Alberto Franco 2002-05-15   12     173      35  street1
s002       V    Gino Mcneill 2002-05-17   12     192      32  street2
s003      VI     Ryan Parkes 1999-02-16   13     186      33  street3
s004      VI    David Parkes 1997-09-15   12     159      32  street4

In [17]:
grouped_School_code.Age.min()

School
s001     12
s002     12
s003     13
s004     12
Name: Age, dtype: int64

In [18]:
grouped_School_code.Age.max()

School
s001     13
s002     14
s003     13
s004     12
Name: Age, dtype: int64

In [19]:
grouped_School_code.Age.mean()

School
s001     12.5
s002     13.0
s003     13.0
s004     12.0
Name: Age, dtype: float64

In [22]:
#3.	Write a Pandas program to split the following given dataframe into groups based on school code and class.
groupby_scl_cls=read.groupby(['School','Class'])
groupby_scl_cls.first()

                        Name        DOB  Age  Height  Weight  Address
School Class
s001    V     Alberto Franco 2002-05-15   12     173      35  street1
        VI      Eesha Hinton 1998-09-25   13     167      30  street1
s002    V       Gino Mcneill 2002-05-17   12     192      32  street2
s003    VI       Ryan Parkes 1999-02-16   13     186      33  street3
s004   VI       David Parkes 1997-09-15   12     159      32  street4

In [27]:
#4.	Write a Pandas program to split the following given dataframe into groups based on school code and cast grouping as a list. 
groupby_schl=read.groupby("School")
#groupby_schl.first()
list(groupby_schl)

[('s001',
    School Class            Name        DOB  Age  Height  Weight  Address
  0   s001     V  Alberto Franco 2002-05-15   12     173      35  street1
  3   s001    VI    Eesha Hinton 1998-09-25   13     167      30  street1),
 ('s002',
    School Class          Name        DOB  Age  Height  Weight  Address
  1   s002     V  Gino Mcneill 2002-05-17   12     192      32  street2
  4   s002     V  Gino Mcneill 2002-05-11   14     151      31  street2),
 ('s003',
    School Class         Name        DOB  Age  Height  Weight  Address
  2   s003    VI  Ryan Parkes 1999-02-16   13     186      33  street3),
 ('s004 ',
    School Class          Name        DOB  Age  Height  Weight  Address
  5  s004     VI  David Parkes 1997-09-15   12     159      32  street4)]

In [30]:
#5.	Write a Pandas program to split the following given dataframe into groups based on single column and multiple columns. Find the size of the grouped data.
print('Single Column Size')
groupby_schl.size()

Single Column Size

School
s001     2
s002     2
s003     1
s004     1
dtype: int64

In [31]:
print('Multi column Size')
groupby_scl_cls.size()

Multi column Size

School  Class
s001     V       1
         VI      1
s002     V       2
s003     VI      1
s004    VI       1
dtype: int64

In [32]:
#6.	Write a Pandas program to split the following given dataframe into groups based on school code and call a specific group with the name of the group.
groupby_schl=read.groupby("School")
groupby_schl.get_group('s001')

  School Class            Name        DOB  Age  Height  Weight  Address
0   s001     V  Alberto Franco 2002-05-15   12     173      35  street1
3   s001    VI    Eesha Hinton 1998-09-25   13     167      30  street1

In [33]:
groupby_schl.get_group('s002')

  School Class          Name        DOB  Age  Height  Weight  Address
1   s002     V  Gino Mcneill 2002-05-17   12     192      32  street2
4   s002     V  Gino Mcneill 2002-05-11   14     151      31  street2

In [39]:
groupby_schl.get_group('s003')

  School Class         Name        DOB  Age  Height  Weight  Address
2   s003    VI  Ryan Parkes 1999-02-16   13     186      33  street3

In [40]:
groupby_schl.get_group('s004 ')

  School Class          Name        DOB  Age  Height  Weight  Address
5  s004     VI  David Parkes 1997-09-15   12     159      32  street4